using System.ComponentModel;

Console.WriteLine(@"
        █▀▀ █▀▀█ █▀▀▄ ▀█░█▀ █▀▀ █▀▀█ █▀▀ █▀▀█ █▀▀█
        █░░ █░░█ █░░█ ░█▄█░ █▀▀ █▄▄▀ ▀▀█ █░░█ █▄▄▀
        ▀▀▀ ▀▀▀▀ ▀░░▀ ░░▀░░ ▀▀▀ ▀░▀▀ ▀▀▀ ▀▀▀▀ ▀░▀▀
 ▀▀█▀▀ █▀▀ █▀▄▀█ █▀▀█ █▀▀ █▀▀█ █▀▀█ ▀▀█▀▀ █░░█ █▀▀█ █▀▀█
 ░░█░░ █▀▀ █░▀░█ █░░█ █▀▀ █▄▄▀ █▄▄█ ░░█░░ █░░█ █▄▄▀ █▄▄█
 ░░▀░░ ▀▀▀ ▀░░░▀ █▀▀▀ ▀▀▀ ▀░▀▀ ▀░░▀ ░░▀░░ ░▀▀▀ ▀░▀▀ ▀░░▀
GitHub: https://github.com/NC-JMonteiro     Version: 1.0
--------------------------------------------------------");

void Conversion()
{
    Console.Write("\nDigite a temperatura atual em Celsius: ");
    int celsius = Convert.ToInt32(Console.ReadLine());

    // Calculo de conversão Celsius => Fahrenheit: F° = (C° * 9/5) + 32
    decimal fahrenheit = (celsius * 9m / 5m) + 32;
    Console.WriteLine($"Celsius:\t {celsius}C°");
    Console.WriteLine($"Fahrenheit:\t {fahrenheit}F°");
}
Conversion();